vlm/base/InformationRegisters/бит_МассаПроводаПоТипамТары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_МассаПроводаПоТипамТары</Name>
			<Comment>ЛТ5.30</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МассаНеттоКГ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДополнительныеПризнакиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_МатериалПровода</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/бит_МассаПроводаПоТипамТары/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбязательностьРеквизитов();  
	ДоступностьЭлементовФормы();
КонецПроцедуры                

&НаКлиенте
Процедура ОбязательностьРеквизитов()                  
	
	Элементы.Номенклатура.АвтоОтметкаНезаполненного = Не ЗначениеЗаполнено(Запись.Материал) 
														Или Не ЗначениеЗаполнено(Запись.Размер);
														
	Элементы.Размер.АвтоОтметкаНезаполненного = Не ЗначениеЗаполнено(Запись.Номенклатура);													
	
	Элементы.Материал.АвтоОтметкаНезаполненного = Не ЗначениеЗаполнено(Запись.Номенклатура);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПризнакРазмерГотовойПродукции = Справочники.бит_ЗначенияПоУмолчанию.ПризнакРазмерГотовойПродукции;
    РазмерГотовойПродукции = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(ПризнакРазмерГотовойПродукции, , Истина);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", РазмерГотовойПродукции);
	
	НовыйМассив = Новый Массив;
    НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
    
    Элементы.Размер.ПараметрыВыбора = НовыеПараметры;
	
	Элементы.ДекорацияПодсказка.Заголовок = "Доступен ввод комбинаций данных:
	|1. 'Вид рабочего центра' + 'Размер' + 'Тара' + 'Материал' + 'Масса нетто кг'
	|2. 'Вид рабочего центра' + 'Тара' + 'Материал' + 'Масса нетто кг'";
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)                                 
	
	ДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерПриИзменении(Элемент)

	ДоступностьЭлементовФормы();

КонецПроцедуры                  

&НаКлиенте
Процедура МатериалПриИзменении(Элемент)
	
	ДоступностьЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ДоступностьЭлементовФормы()
	
	Элементы.Размер.Доступность   = Не ЗначениеЗаполнено(Запись.Номенклатура);
	Элементы.Материал.Доступность = Не ЗначениеЗаполнено(Запись.Номенклатура);

	Элементы.Номенклатура.Доступность = Не ЗначениеЗаполнено(Запись.Размер) И Не ЗначениеЗаполнено(Запись.Материал);
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Запись.Размер = ПредопределенноеЗначение("Справочник.бит_ДополнительныеПризнакиНоменклатуры.ПустаяСсылка");
		Запись.Материал = ПредопределенноеЗначение("Перечисление.бит_МатериалПровода.ПустаяСсылка");
	КонецЕсли;
	
	ОбязательностьРеквизитов();
	
КонецПроцедуры
